[
  {
    "id": 1,
    "name": "Credit Recover for trade Business",
    "price": 420,
    "ratings": 4,
    "ratingsCount": 3725,
    "img": "https://images.unsplash.com/photo-1642790551116-18e150f248e3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTh8fHRyYWRlfGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "details": "Businesses can establish lines of credit with each other — for example, if an office supply store lets your business run a tab when purchasing office supplies. Talk to your vendors and ask if they report your payment history to Dun & Bradstreet. If they don’t, then ask them to start if they do that for other customers. Invoicing. Make sure to send out invoices as quickly as possible. The sooner an invoice goes out, the sooner the clock starts ticking on a customer’s deadline to pay you.  Deposits. If you run a professional services business, and you haven’t been requiring deposits, consider this an opportunity to start doing so. Incentives. Think about offering customers a discount if they pay up front, or pay within a certain amount of time. Costs. Check for recurring costs you can trim, such as unneeded software. As you take steps to improve your business credit score, you’ll want to keep an eye on it to ensure what you’re doing is actually working. One way to monitor your business credit is via Experian’s SmartBusinessReports, which has options for multiple report plans, each providing varying levels of detail. Costs range from $39.95 per report to $1,995 per year. If you see a drop in your business credit score, look at ways to improve cash flow, such as invoicing quickly, requiring deposits, offering incentives to customers who pay up front and trimming costs. This will give you a chance to pay down debt and reduce any big balances you may have on  business cards or loans. Finally, lean on your vendor relationships. Make sure your trade credit is getting reported to Dun & Bradstreet and Experian, so your business gets credit for good behavior. It can take some work, but bumping up your score can save you money over time."
  },
  {
    "id": 2,
    "name": "Product Recover for trade Business",
    "price": 196,
    "ratings": 5,
    "img": "https://images.unsplash.com/photo-1554769944-3138b076c38a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NXx8Z29vZHN8ZW58MHx8MHx8&auto=format&fit=crop&w=500&q=60",
    "details": "During a recession, many businesses fail and go out of business, and many of those that survive cut back activities to reduce costs in the face of decreased demand for their output. Workers often get laid off and business assets get sold piecemeal. Sometimes business owners are forced to liquidate an entire business. Some of these capital assets end up in the hands of other businesses, sometimes even brand new businesses, that can put them to productive use. Sometimes these are very similar to their previous uses, and sometimes these are totally new lines of business. This process of sorting capital goods into new combinations, under new ownership, at new prices after they have been released from failed businesses or business cutbacks in the recession, is the essence of economic recovery. Businesses usually need to deal with a leaner credit environment relative to the easy credit days of the boom that preceded the recession. They may need to implement new technologies and organizational forms. Almost always, the government fiscal and regulatory environment that businesses operate under changes from the boom to the recession and recovery. In the end, the recovery can change the patterns of economic activity in an economy, sometimes drastically and sometimes in barely noticeable ways. The economy heals the damage during the preceding parts of the business cycle by reallocating, reusing, and recycling resources into new uses, in an analogous way to how the body breaks down dead and damaged tissue in order to produce new, healthy cells and tissues after an injury."
  },
  {
    "id": 3,
    "name": "Credit Recover for Corporate Partner",
    "price": 245,
    "ratings": 4,
    "ratingsCount": 3972,
    "img": "https://images.unsplash.com/photo-1604156425963-9be03f86a428?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTR8fG1vbmV5fGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "details": "As shared services mature, they strive to be and to be seen as value adding partners to the business. In addition to providing higher value functions, shared services are also finding ways to add to the company’s bottom line. In finance shared services, making sure payment processes are watertight is crucial. Finding new streams of profit to add to the bottom line will also help to highlight the value of your AP department. Many finance shared services have gotten better at preventing and catching duplicate payments through improved processes and through ERP systems. However many haven’t taken full advantage of Vendor Credit Recovery audits. Ed Martinez, former Shared Services Director of Wendy’s and a consultant to shared service professionals recently wrote an article for us on best practice in AP. “Cash generated from the prevention and/or recovery of duplicate payments has decreased over the years. That means the large cash recovery opportunities can be found in an AP Vendor Audit Credit Recovery,” Martinez explained. Vendor Credit Recovery, a term actually trademarked by JPD Financial, is an audit credit recovery process that recovers cash credits that reside on the supplier’s Accounts Receivables (AR) books. These credits are the result of various factors such as overpayments to AP vendors by the AP staff as well as returns, rebates and allowances not properly processed by vendors. Thomas Santacroce, VP of Business Development & Marketing at JPD Financial explains that with shared services, “it’s often not what goes wrong in our client’s AP, it’s across the hundreds or thousands of their suppliers.” Shared services, Santacroce said, “are dealing suppliers of all shapes and sizes and stages of their evolution and not everyone is on SAP. Suppliers may have issues with their systems or resources and can struggle to cope with the sheer volume of transactions. Vendor Credit Recovery firms work with buyers to identify all of their auditable suppliers to find any money that may be owed back to the company. Santacroce says that interestingly, many of their shared services clients find that the credits recovered did not originate in the AP department. Many come from returns, warranties, rebates, or pricing, which are issues that originates at the suppliers’ end.  While many shared services have made great strides towards improving their payment processes, Santacroce says, “Our clients have become very adept at fixing what happens within the four walls of their organization, but they can’t fix what happens within the four walls of their suppliers.”"
  },
  {
    "id": 4,
    "name": "Product Recover from Corporate Partner",
    "price": 420,
    "ratings": 4,
    "ratingsCount": 3725,
    "img": "https://images.unsplash.com/photo-1494976388531-d1058494cdd8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NHx8Y2FyfGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "details": "With the worldwide crisis over the past few months, everyone’s income has been in constant jeopardy, so they’ve been spending less. But the certainty that things will get better motivates businesses to keep running – and find ways to recover after taking damage. During the lockdown, one big task you could have started working on is Internet marketing, particularly SEO. Where does your site rank in search engines? How good are you at getting user traffic and converting it to leads?  This is a turning point for many a business – an opportunity to display your marketing prowess and strengthen your bond with your customers. And the other half of your recovery plan?  That’s what we are going to explore in detail. What can you do to reverse the damage caused by the lockdown? Let’s find out. Just from this description, you can get the gist of what each of these two types of people may need. And with a detailed customer persona, you can gain even more insight into their wants.  One after another, countries are lifting their lockdown restrictions. However, it’s too early to relax. Play it safe and assume the lockdown isn’t ending anytime soon (no matter how depressing it may sound). How is it going to affect your work? If you run an ecommerce store, keep your stock full at all times. Almost everyone shops online now, so if you don’t watch your stock, you’ll risk running out. Another way is to make yourself less expensive (and more appealing) to customers. Discounts and special offers are even more effective than ever, thanks to literally everyone trying to save money. In fact, so many businesses have been offering discounts, customers expect them from everybody now."
  },
  {
    "id": 5,
    "name": "Business Loan Recover",
    "price": 196,
    "ratings": 5,
    "ratingsCount": 4455,
    "img": "https://images.unsplash.com/photo-1633158829585-23ba8f7c8caf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mnx8bG9hbnxlbnwwfHwwfHw%3D&auto=format&fit=crop&w=500&q=60",
    "details": "The new iteration of the Recovery Loan Scheme (RLS) is designed to support access to finance for UK businesses as they look to invest and grow. It will support facility sizes of up to £2million for borrowers outside the scope of the Northern Ireland Protocol. Borrowers in scope of the Northern Ireland Protocol may borrow up to £1million unless they operate in a sector where aid limits are reduced in which case the maximum that can be borrowed is subject to a lower cap. These include agriculture, fisheries / aquaculture, and road freight haulage. Businesses can use the finance for any legitimate business purpose – including managing cashflow, investment and growth. However, businesses must be able to afford to take out additional debt finance for these purposes. The British Business Bank will administer the scheme on behalf of the of the Secretary of State for BEIS. The Recovery Loan Scheme aims to improve the terms on offer to borrowers. If a lender can offer a commercial loan on better terms, they will do so. Up to £2 million per business group: The maximum amount of a facility provided under the scheme is £2 million per business group for borrowers outside the scope of the Northern Ireland Protocol, and up to £1 million per business group for Northern Ireland Protocol borrowers[1]. Minimum facility sizes vary, starting at £1,000 for asset and invoice finance, and £25,001 for term loans and overdrafts. Wide range of products: RLS supports term loans, overdrafts, asset finance and invoice finance facilities. Not all lenders will be able to offer all products. Term length: Term loans and asset finance facilities are available from three months up to six years, with overdrafts and invoice finance available from three months up to three years. Access to multiple schemes: Businesses that took out a CBILS, CLBILS, BBLS or RLS facility before 30 June 2022 are not prevented from accessing RLS after 1 August 2022, but in some instances borrowing under these schemes may reduce the maximum amount you are eligible for. Pricing: The annual effective rate of interest and upfront and other fees cannot be more than 14.99%. Personal Guarantees: Personal guarantees can be taken at the lender’s discretion, in line with their normal commercial lending practices. Principal Private Residences cannot be taken as security within the Scheme. Guarantee is to the lender: The scheme provides the lender with a 70% government-backed guarantee against the outstanding balance of the facility after it has completed its normal recovery process. The borrower always remains 100% liable for the debt.    Decision-making delegated to the lender: Recovery Loan Scheme-backed facilities are provided at the discretion of the lender. Lenders are required to undertake their standard credit and fraud checks for all applicants. The assistance provided through RLS, like many Government-backed business support activities, is regarded as a subsidy and is deemed to benefit the borrower. There is a limit to the amount of subsidy that may be received by a borrower, and its wider group, over any rolling three-year period. Any previous subsidy may reduce the amount a business can borrow."
  },
  {
    "id": 6,
    "name": "Credit Card Loan Recover",
    "price": 245,
    "ratings": 4,
    "ratingsCount": 3972,
    "img": "https://images.unsplash.com/photo-1556742208-999815fca738?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NHx8Y3JlZGl0JTIwcmVjb3ZlcnxlbnwwfHwwfHw%3D&auto=format&fit=crop&w=500&q=60",
    "details": "1. Make a payoff plan It's a lot easier to feel in control of your debt if you have a plan for paying it off. To make your plan: Discover: This card has one of the longest intro 0% interest periods around More: Consolidate debt with one of these top-rated balance transfer credit cards Make a list of all your credit card balances, including the total owed and the interest rate. Calculate the minimum monthly payments and the total amounts due. Decide how much extra you can put toward repaying your debt faster. Choose which debt to focus on repaying first, so you can send extra money to that debt while paying only the minimums on the others. For most people, the best approach is to choose the card with the highest interest rate and then move on to the card with the next highest rate and so on. Some people prefer to choose the card with the lowest balance so they can pay it off more quickly and stay motivated by scoring quick wins. When you have a plan of action to tackle your debt, you're more likely to be able to successfully repay your creditors in a timely manner. And having a plan means you'll feel more in charge when it comes to managing your financial future. 2. Consider refinancing your credit card debt The high interest rates credit card companies charge makes it hard to pay off your credit card debt because a lot of your money is wasted paying interest. Refinancing could fix that. If you refinance, you get a new loan and pay off the existing high interest debt. You could use a personal loan to consolidate debt, or use a balance transfer credit card and move multiple balances to it. Getting rid of many small debts and ending up with one bigger one with a lower rate can make repayment a lot easier. You'll have only one monthly payment to make and won't have to decide what order to repay your debt in. You can also lower your total monthly payments and ensure more of each one goes to principal rather than interest. 3. Rework your budget Putting extra money toward credit card repayment can help you climb out of the hole faster. So, for a period of time, consider paying for only the necessities and fixed costs such as your mortgage, car loan, and groceries. Beyond that, put as much of your money as you can toward debt payoff. By reworking your budget to focus on sending as much money as possible to your creditors, you can pay your balance down much more quickly than if you were just sending in smaller payments each month. 4. Consider a temporary second job Working a part-time side gig could bring in some extra money to help supercharge your repayment efforts. Since this is money outside your regular earnings, you can use the entire amount to pay down your debt so you can repay your principal much faster. 5. Talk with your creditors Finally, you should talk to your creditors about your options if you're truly in over your head and can't afford to pay the minimums or don't feel like you'll ever be able to pay your full balance off. Creditors may be willing to allow you to work out a repayment plan or settle debt for a lump sum payment that's less than what you currently owe. Taking this step of asking creditors for help can be hard because it can often damage your credit score. But if you are struggling a lot financially due to the amount of credit card debt you have, finding a way to pay back less may be your best and only choice. Be sure to consider each of these five tips carefully and pick the one that's right for you given how much debt you have and how feasible it is to repay it within a reasonable time without jeopardizing other important goals."
  }
]
